_posts/2021-10-04-abc200-d-upsolving.html
---
layout: post
title: abc200 D - Happy Birthday! 2
tags: AtCoder
---

<div id="outline-container-org7f1ba07" class="outline-2">
<h2 id="org7f1ba07">D - Happy Birthday! 2</h2>
<div class="outline-text-2" id="text-org7f1ba07">
<ul class="org-ul">
<li>N이 최대 200까지</li>
<li>B배열과 C배열을 A배열에서 분리해낸다.
<ul class="org-ul">
<li>배열의 크기가 다르거나, 값이 달라야 한다.</li>
</ul></li>
<li>비둘기집 원리를 문제에 적용해야 함. 생각이 쉽지 않다.</li>
</ul>
</div>
</div>

<div id="outline-container-org364374c" class="outline-2">
<h2 id="org364374c"><span class="todo TODO">TODO</span> 접근하기</h2>
<div class="outline-text-2" id="text-org364374c">
<ul class="org-ul">
<li>N &lt;= 8까지 해도, 2^8-1 =255 경우를 찾을 수 있다.</li>
<li>그 사이 답을 1개만 찾아서 출력하면 된다.</li>
</ul>
<ul class="org-ul">
<li>bit연산 or재귀로 2^N 완전탐색 구현</li>
<li>1인 목록의 sum을 구하고 200으로 나머지셈 위치에 저장 (Hash table)</li>
<li>이후에 sum을 구해서 %200한 hash의 위치에 값이 있으면 출력하고, 자신도 출력</li>
</ul>
</div>
</div>

<div id="outline-container-orge78f989" class="outline-2">
<h2 id="orge78f989">코드 - 완전탐색 이용</h2>
<div class="outline-text-2" id="text-orge78f989">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;iostream&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;vector&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[210];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">b</span>[12];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">bend</span>;

<span style="color: #8ae234; font-weight: bold;">vector</span> &lt; <span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; &gt; <span style="color: #ff6347;">v</span>(200, vector&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt;(0));

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">bt</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span>)
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (bend) <span style="color: #729fcf; font-weight: bold;">return</span>;

    <span style="color: #729fcf; font-weight: bold;">if</span> (idx &gt;= n) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">sum</span> = 0;
        <span style="color: #8ae234; font-weight: bold;">vector</span> &lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">tmp</span>;
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;n;i++) {
            <span style="color: #729fcf; font-weight: bold;">if</span>(b[i]) {
                sum += a[i];
                sum = sum % 200;
                tmp.push_back(i+1);
            }
        } 

        <span style="color: #729fcf; font-weight: bold;">if</span> (v[sum].size() == 0) {
            v[sum] = tmp;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            printf(<span style="color: #ad7fa8; font-style: italic;">"Yes\n"</span>);
            cout &lt;&lt; tmp.size();
            <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span> &amp;<span style="color: #ff6347;">x</span> : tmp) {
                cout &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">" "</span> &lt;&lt; x;
            }
            cout &lt;&lt; endl;

            cout &lt;&lt; v[sum].size();
            <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span> &amp;<span style="color: #ff6347;">x</span> : v[sum]) {
                cout &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">" "</span> &lt;&lt; x;
            }
            cout &lt;&lt; endl;
            bend = 1;
        }
        <span style="color: #729fcf; font-weight: bold;">return</span>;
    }

    b[idx] = 0;
    bt(idx+1);

    b[idx] = 1;
    bt(idx+1);
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;a[i]);
    }

    n = min(8, N); 
    bt(0);
    <span style="color: #729fcf; font-weight: bold;">if</span> (bend == 0)
        printf(<span style="color: #ad7fa8; font-style: italic;">"No\n"</span>);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3531b2" class="outline-2">
<h2 id="orgc3531b2">코드 - 비트연산 이용</h2>
<div class="outline-text-2" id="text-orgc3531b2">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;iostream&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;vector&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[210];

<span style="color: #8ae234; font-weight: bold;">vector</span> &lt; <span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; &gt; <span style="color: #ff6347;">v</span>(200, vector&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt;(0));

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;a[i]);
    }

    n = min(8, N); 

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;(1&lt;&lt;n);i++) {

        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">sum</span> = 0;
        <span style="color: #8ae234; font-weight: bold;">vector</span> &lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">tmp</span>;
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=0;j&lt;n;j++) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (i &amp; (1&lt;&lt;j)) {
                sum += a[j];
                sum = sum % 200;
                tmp.push_back(j+1);
            }    
        }

        <span style="color: #729fcf; font-weight: bold;">if</span> (v[sum].size() == 0) {
            v[sum] = tmp;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            printf(<span style="color: #ad7fa8; font-style: italic;">"Yes\n"</span>);
            cout &lt;&lt; tmp.size();
            <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span> &amp;<span style="color: #ff6347;">x</span> : tmp) {
                cout &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">" "</span> &lt;&lt; x;
            }
            cout &lt;&lt; endl;

            cout &lt;&lt; v[sum].size();
            <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span> &amp;<span style="color: #ff6347;">x</span> : v[sum]) {
                cout &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">" "</span> &lt;&lt; x;
            }
            cout &lt;&lt; endl;
            <span style="color: #729fcf; font-weight: bold;">return</span> 0; 
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"No\n"</span>);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org7cb299c" class="outline-2">
<h2 id="org7cb299c">문제 링크</h2>
<div class="outline-text-2" id="text-org7cb299c">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc200/tasks/abc200_d">https://atcoder.jp/contests/abc200/tasks/abc200_d</a></li>
</ul>
</div>
</div>
